/*변수(Variable)*/
/*값 하 나를 저장할 수 있는 공간*/
/*변수를 사용하기 위해서는*/

/*1. 변수의 선언*/
/*선언문법 : 자료형 변수명;*/
/*자료형 : 자료의 형태(숫자,문자,날짜)*/
/*2. 변수의 초기화*/
/*변수 선언 후 최초에 값을 할당(저장)하는 행위*/

/*변수명 정의법*/
/*변수명은 소문자로 작성한다.(관례)*/
/*변수명은 명확해야하고, 복합어의 경우 카멜케이스(camel case)로 작성한다.*/
/*복합어ex 국어+점수 = korean score = korScore = 카멜케이스*/
/*스네이크 케이스 = kor_score*/
/*카멜 케이스 = korScore*/
/*클래스명은 대문자로 작성해야한다.*/


public class 변수_01 {
    public static void main(String[] args){
        /*변수의 선언*/
        int num; /*인트 = integar(정수)*/
        /*정수를 저장할 공간 num을 선언하겠다*/
        /*박스 만들고 이름붙힌게 "num"이건 css의 클래스와 같이 마음대로 줄 수 있다.*/
        num = 5;
        /*변수의 초기화*/
        /* = 우측의 값을 왼쪽에 저장한다*/

        //변수에 데이터 저장
        num = 10;

        System.out.println(num+5);
        System.out.println(num);
        /*출력문의 소괄호 안에 변수명을 넣으면 변수에 저장된 값을 출력*/
        /*쌍따옴표는 문자 그대로 출력한다.*/

    }
}
